---
kind: property
id: P:Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LeadingSpaces
source: html/2f16ea7b-3601-518f-5c2e-4340b5277a5e.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LeadingSpaces Property

The number of spaces to include before the parameter value.

## Syntax (C#)
```csharp
public int LeadingSpaces { get; set; }
```